pets_adoption_api/app/controllers/matches_controller.rb

    def show
      @owners = Owner.find(params[:owner_id])
      @pets = @owners.pets.as_json(:include => :matches)

        @owner = @owners.select { |owner|
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."pet_id" = $1  [["pet_id", 3]]
SELECT "pets".* FROM "pets" INNER JOIN "matches" ON "pets"."id" = "matches"."pet_id" WHERE "matches"."owner_id" = $1  [["owner_id", 2]]

    def create
      @pet = Pet.find(params[:pet_id])
      @owner = Owner.find(params[:owner_id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
      @match = Match.find(params[:id])
      # if not the right user cancel
      # if no match cancel
      if @match
        @match.destroy
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 3]]