pets_adoption_api/app/controllers/matches_controller.rb

    def index
        @owners = Owner.find(params[:owner_id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        def create
            @owner = Owner.find(params[:owner_id])
            @pet = Pet.new(match_params)

            if @owner.save
              @owner.pets.push(@pet)
---
INSERT INTO "matches" ("pet_id", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pet_id", 4], ["owner_id", 2], ["created_at", "2019-06-06 14:30:09.484748"], ["updated_at", "2019-06-06 14:30:09.484748"]]