pets_adoption_api/app/controllers/owners_controller.rb

    def index
        @owners = Owner.all
---
SELECT "owners".* FROM "owners"

    def show
        @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        def create
            @owner = Owner.new(owner_params)

            if @owner.save
---
INSERT INTO "owners" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "niec"], ["created_at", "2019-06-06 21:37:43.253607"], ["updated_at", "2019-06-06 21:37:43.253607"]]

    def destroy
        @owner = Owner.find(params[:id])
        @owner.destroy
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "owners" WHERE "owners"."id" = $1  [["id", 1]]

    def update
        @owner = Owner.find(params[:id])
        if @owner.update(owner_params)
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "owners" SET "name" = $1, "age" = $2, "location" = $3, "email" = $4, "phone_number" = $5, "description" = $6, "updated_at" = $7 WHERE "owners"."id" = $8