pets_adoption_api/app/controllers/owners_controller.rb

    def update
        @owner = Owner.find(params[:id])
        if @owner.update(pet_params)
---
UPDATE "owners" SET "name" = $1, "age" = $2, "location" = $3, "photo" = $4, "email" = $5, "phone_number" = $6, "updated_at" = $7 WHERE "owners"."id" = $8