pets_adoption_api/app/controllers/pets_controller.rb

    def index
        @pets = Pet.all
---
SELECT "pets".* FROM "pets"

    def create
	    @pet = Pet.new(pet_params)
	    if @pet.save
---
INSERT INTO "pets" ("name", "location", "age", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "niecey"], ["location", "brooklyn"], ["age", 28], ["description", "funny"], ["created_at", "2019-06-07 10:40:44.549528"], ["updated_at", "2019-06-07 10:40:44.549528"]]

    def show
        @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
    @pet = Pet.find(params[:id])

    if @pet.update(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pets" SET "name" = $1, "age" = $2, "breed" = $3, "location" = $4, "photo" = $5, "description" = $6, "updated_at" = $7 WHERE "pets"."id" = $8  [["name", "niecey"], ["age", 28], ["breed", "pitbull"], ["location", "brooklyn"], ["photo", "ayye"], ["description", "funny"], ["updated_at", "2019-06-07 10:44:01.831469"], ["id", 1]]

  def destroy
    @pet = Pet.find(params[:id])
    @pet.destroy
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]