pets_adoption_api/app/controllers/pets_controller.rb

  def show
      @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]