pets_adoption_api/app/controllers/pets_controller.rb

SELECT  "owners".* FROM "owners" WHERE "owners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @owners = Owner.find(params[:owner_id])